[
    {
        "year": "2021",
        "imgs": ["/images/gvsu-logo.png"],
        "data": 
        [
            "Switched my major from Computer Engineering to Computer Science, while continuing to pursue a minor in Computer Engineering.",
            "Tutored an introductory JavaScript programming course at Grand Valley State University, helping students build foundational coding skills.",
            "Worked seasonally between college semesters as a car dealership porter, cleaning cars, valeting customers, and assisting with vehicle management."
        ]
    },
    {
        "year": "2022",
        "imgs": ["/images/augusto-logo.png"],
        "data": 
        [
            "Completed a 12-week summer internship with Stellantis as a Software Experience Intern, creating logic and signal networks of vehicle models for pre-production virtualization testing of un-released Stellantis vehicles.",
            "Received a full-time offer to return to the same team at Stellantis following the internship, starting in January 2023.",
            "Collaborated with a team on a senior capstone project sponsored by Augusto Digital, developing a React-based web application — my first major development experience using React.",
            "Graduated from Grand Valley State University in December with a major in Computer Science and minors in Computer Engineering and Mathematics."
        ]
    },
    {
        "year": "2023",
        "imgs": ["/images/stellantis-logo1.png"],
        "data": 
        [
            "Began working full-time for Stellantis primarily as a Plant Model Engineer, continuing internship work of creating logic and signal networks of vehicle models for pre-production virtualization testing of un-released Stellantis vehicles.",
            "Automated key Plant Model processes to significantly reduce manual effort, increase accuracy, and streamline development workflows.",
            "Completed SAFe® (Scaled Agile Framework) Certification, gaining practical knowledge in lean-agile principles, cross-functional collaboration, and scalable project delivery to support efficient, iterative development.",
            "Continued learning more about HIL/SIL automotive engineering and the specifics of our project to grow into new roles."
        ]
    },
    {
        "year": "2024",
        "imgs": ["/images/stellantis-logo2.png"],
        "data": 
        [
            "Expanded responsibilities to include debugging and testing Plant Models from a higher-level perspective, collaborating with testing and computer engineers to troubleshoot and resolve complex system issues.",
            "Shifted focus toward larger project pipeline management, supporting high-priority debugging efforts and on-time delivery of critical model updates.",
            "Chose to leave my full-time role at Stellantis at the end of the year to pursue a new career in web development. While I value the experience, I realized my long-term interests were better aligned with software and front-end development.",
            "Began classes in front-end web development through Coursera in November, focusing on building practical skills in modern web technologies."
        ]
    },
    {
        "year": "2025",
        "imgs": ["/images/coursera-logo.png"],
        "data": 
        [
            "Earned Meta's Front-End Developer Professional Certificate and Scrimba's Professional React Developer Specialization through Coursera.",
            "Built and deployed native HTML, CSS, and JavaScript projects, including Fuller Photography and Rebie's Bakery, to strengthen foundational web development skills.",
            "Developed NBA Stats, a React-based application for exploring player and team statistics — further deepening my experience with modern front-end frameworks.",
            "Continuing my education by beginning courses in backend development, while actively building new projects that reinforce and apply the skills being learned."
        ]
    }
]